# Use `brew bundle` to install the packages listed below

# Essential command line tools
brew 'vim'
brew 'neovim'
cask 'neovide'
brew 'tmux'
brew 'git'
brew 'git-lfs'
brew 'gh' # official github cli
brew 'git-delta' # diff alternative, used in my git config
brew 'diff-pdf'
brew 'fd'
brew 'ag'
brew 'rg'
brew 'fzf'
brew 'jq'
brew 'yq' # jq for yaml
brew 'coreutils' # gnu utils, prefixed by 'g'. e.g. 'gsed'
brew 'telnet'
brew 'wget'
brew 'curl'
brew 'watch'
brew 'curl'
brew 'grep'
brew 'openssl'
brew 'tree'
brew 'nmap'
brew 'htop'
brew 'ssh-copy-id'
brew 'trash'
brew 'mobile-shell' # mosh
brew 'rlwrap'
brew 'sloccount'
brew 'mtr'
brew 'eza' # ls replacement
brew 'bat' # cat replacement
brew 'duf' # df but only for file system level info
brew 'dust' # du replacement
brew 'viddy' # watch replacment
brew 'btop' # top replacement
#brew 'dog' # dig replacement (unmaintained)
brew 'gum' # CLI tools (e.g. `gum choose` makes selection screen)


brew 'atuin' # ctrl-r history in sqlite db!
brew 'zsh'
brew 'bash' # the bash shipped with OS X is horribly out of date
brew 'bash-completion'

# Terminals
cask 'ghostty'
cask 'kitty'

# Docker/VMs
brew 'docker'

# JVM languages

# brew 'jabba' # this is totally broken in brew and has been for a year.. :/
brew 'gradle'
brew 'maven'
brew 'leiningen'

#cask 'intellij-idea'
#cask 'yourkit-java-profiler'

# Javascript
brew 'nvm'
brew 'node'
#brew 'phantomjs'

# Python
brew 'uv'
brew 'python'
brew 'pipx'

# Databases
#brew 'datomic'
brew 'postgresql'
brew 'pgadmin4'
#brew 'mysql'
#cask 'sequel-pro'

# Quality of life OS X improvements
cask 'rectangle'
#cask 'hyperswitch'
#cask 'karabiner-elements'
#cask 'bettertouchtool'

# Programming related applications
cask 'sourcetree'
cask 'p4v' # I just want p4merge super occasionally
#cask 'wireshark'
cask 'hoppscotch' # open source version of postman

# Browsers
cask 'firefox'
cask 'google-chrome'

# Misc
cask 'vlc'
#cask 'omnigraffle'
#cask 'flycut'
