# Use `brew bundle` to install the packages listed below

# Essential command line tools
brew 'vim'
brew 'neovim'
cask 'macvim'
brew 'tmux'
brew 'git'
brew 'git-lfs'
brew 'gh' # official github cli
brew 'git-delta' # diff alternative, used in my git config
brew 'fd'
brew 'ag'
brew 'fzf'
brew 'jq'
brew 'yq' # jq for yaml
brew 'coreutils' # gnu utils, prefixed by 'g'. e.g. 'gsed'
brew 'telnet'
brew 'wget'
brew 'curl'
brew 'watch'
brew 'curl'
brew 'grep'
brew 'openssl'
brew 'tree'
brew 'nmap'
brew 'htop'
brew 'ssh-copy-id'
brew 'trash'
brew 'mobile-shell' # mosh
brew 'rlwrap'
brew 'sloccount'
brew 'mtr'
brew 'exa' # ls replacement
brew 'bat' # cat replacement

brew 'bash' # the bash shipped with OS X is horribly out of date
brew 'bash-completion'

cask 'iterm2'

# Docker/VMs
brew 'docker'
brew 'docker-compose'

# JVM languages

# brew 'jabba' # this is totally broken in brew and has been for a year.. :/
brew 'gradle'
brew 'maven'
brew 'leiningen'
brew 'candid82/brew/joker'

#cask 'intellij-idea'
#cask 'yourkit-java-profiler'

# Javascript
brew 'nvm'
brew 'node'
#brew 'phantomjs'

# Databases
brew 'datomic'
brew 'postgresql'
#brew 'mysql'
#cask 'sequel-pro'

# Quality of life OS X improvements
cask 'rectangle'
#cask 'hyperswitch'
#cask 'karabiner-elements'
#cask 'bettertouchtool'

# Programming related applications
cask 'sourcetree'
cask 'p4v' # I just want p4merge super occasionally
#cask 'wireshark'
cask 'postman'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Misc
cask 'vlc'
#cask 'omnigraffle'
#cask 'flycut'
cask 'homebrew/cask-drivers/zsa-wally' # Keyboard flashing for my ergodox
