# Use `brew bundle` to install the packages listed below

# Essential command line tools
brew 'vim'
brew 'neovim'
cask 'macvim'
brew 'tmux'
brew 'git'
brew 'gist'
brew 'hub'
brew 'fasd'
brew 'fd'
brew 'ripgrep'
brew 'ag'
brew 'fzf'
brew 'bench'
brew 'jq'
brew 'coreutils' # gnu utils, prefixed by 'g'. e.g. 'gsed'
brew 'wget'
brew 'curl'
brew 'watch'
brew 'curl'
brew 'grep'
brew 'openssl'
brew 'tree'
brew 'nmap'
brew 'htop'
brew 'ssh-copy-id'
brew 'trash'
brew 'mobile-shell' # mosh
brew 'rlwrap'
brew 'sloccount'

brew 'bash' # the bash shipped with OS X is horribly out of date
brew 'bash-completion'

cask 'iterm2'

# Docker/VMs
cask 'virtualbox'
cask 'vagrant'
brew 'docker'
brew 'docker-compose'

# DevOps/Automation
cask 'puppetlabs/puppet/pdk'
cask 'puppetlabs/puppet/puppet-agent'
#brew 'ansible'

# JVM languages
cask 'java'
tap 'caskroom/versions'

brew 'gradle'
brew 'maven'
brew 'leiningen'

#cask 'intellij-idea'
cask 'yourkit-java-profiler'

# Javascript
brew 'nvm'
brew 'node'
brew 'phantomjs'

# Databases
brew 'datomic'
brew 'postgresql'
#brew 'mysql'
#cask 'sequel-pro'

# Quality of life OS X improvements
cask 'spectacle'
cask 'hyperswitch'
cask 'karabiner-elements'
# cask 'bettertouchtool'

# Programming related applications
cask 'sourcetree'
cask 'github'
cask 'p4v' # I just want p4merge
cask 'wireshark'
cask 'postman'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Misc
cask 'vlc'
cask 'omnigraffle'
cask 'flycut'
cask 'gnucash'

# Quick Look plugins for Finder
cask 'qlcolorcode' # syntax highlighting
cask 'qlstephen'   # plaintext files with no or unknown extension 
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlimagesize' # show image size and resolution
cask 'webpquicklook' # webp support
